
# YOLOv8n 配置文件（带SE注意力机制）
# 针对变电站小目标检测优化

nc: 1  # 类别数量
scales: # 模型复合缩放常数，用于yolov8n.yaml
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# 骨干网络
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_SE, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_SE, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_SE, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SE, [1024, True]]

# 检测头
head:
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, Conv, [256]]
  - [-1, 3, C2f_SE, [256]]

  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, Conv, [128]]
  - [-1, 3, C2f_SE, [128]]

  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [64]]
  - [-1, 3, C2f_SE, [64]]

  - [[-1, 1, 1, 3], 1, Detect, [1]]  # Detect(P3, P4, P5)
